src/config/Documents/КорректировкаЗаявкиНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>КорректировкаЗаявкиНаРасходованиеСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗаявкиНаРасходованиеСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредствИсточник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаРасходованиеСредствПриемник</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДанныеЗаявкиИсточник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДанныеЗаявкиПриемник</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сделка</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/config/AccumulationRegisters/ЗаявкиНаРасходованиеСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ЗаявкиНаРасходованиеСредств</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаВзаиморасчетов</Name>
					<Comment>Сумма в валюте взаиморасчетов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Comment>Сумма в валюте упр. учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Comment>Сумма к оплате</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаРасхода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеИсходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеДопРасходов</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПоставщика</v8:Type>
						<v8:Type>cfg:DocumentRef.РасходныйКассовыйОрдер</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПереданный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПолученное</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщикуИзНеавтоматизированнойТорговойТочки</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолгаПоВозвратнойТаре</v8:Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровПоставщику</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНеавтоматизированнуюТорговуюТочку</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеПоручениеВходящее</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежноеТребованиеВыставленное</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерПоступлениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.АккредитивПолученный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПлатежныйОрдерСписаниеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказПоПрессФормам</v8:Type>
						<v8:Type>cfg:DocumentRef.ИнкассовоеПоручениеПереданное</v8:Type>
						<v8:Type>cfg:DocumentRef.КорректировкаДолга</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/config/Documents/КорректировкаЗаявкиНаРасходованиеСредств/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеНеЗаполнено(ЗаявкаНаРасходованиеСредствИсточник)	Тогда
		Сообщить("Не выбрана заявка-источник",СтатусСообщения.Важное);
		Отказ=Истина;
	КонецЕсли;	
	
	Если ЗначениеНеЗаполнено(ЗаявкаНаРасходованиеСредствПриемник)	Тогда
		Сообщить("Не выбрана заявка-приемник",СтатусСообщения.Важное);
		Отказ=Истина;
	КонецЕсли;	
	
	Если НЕ Отказ Тогда
		Если ДанныеЗаявкиИсточник.Итог("СуммаПлатежа")<>ДанныеЗаявкиПриемник.Итог("СуммаПлатежа") Тогда
		Сообщить("Суммы переданная = " +Строка(ДанныеЗаявкиИсточник.Итог("СуммаПлатежа"))+" и принятая = "+Строка(ДанныеЗаявкиПриемник.Итог("СуммаПлатежа"))+" отличаются.",СтатусСообщения.Важное);
		Отказ=Истина;
		КонецЕсли;
	КонецЕсли;	
	
	Если  Отказ Тогда
	Возврат;
	КонецЕсли;
		
		

	
	Запрос=Новый Запрос;
	
Запрос.Текст="ВЫБРАТЬ 
|КорректировкаЗаявки.ДоговорКонтрагента ДоговорКонтрагента,
|КорректировкаЗаявки.Сделка Сделка,
|КорректировкаЗаявки.СтатьяДвиженияДенежныхСредств СтатьяДвиженияДенежныхСредств,
|КорректировкаЗаявки.СуммаПлатежа СуммаПлатежа,
|ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток СуммаОстаток
|ИЗ
| (ВЫБРАТЬ ДоговорКонтрагента,
| Сделка,
| СтатьяДвиженияДенежныхСредств,
| СуммаПлатежа
|ИЗ
|	Документ.КорректировкаЗаявкиНаРасходованиеСредств.ДанныеЗаявкиИсточник
|	ГДЕ Ссылка=&ТекущийДокумент
|	)  КорректировкаЗаявки
|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаявкиНаРасходованиеСредств.Остатки(,ЗаявкаНаРасходование = &ЗаявкаНаРасходование) КАК ЗаявкиНаРасходованиеСредствОстатки
|		ПО КорректировкаЗаявки.ДоговорКонтрагента = ЗаявкиНаРасходованиеСредствОстатки.ДоговорКонтрагента
|			И КорректировкаЗаявки.Сделка = ЗаявкиНаРасходованиеСредствОстатки.Сделка
|			И КорректировкаЗаявки.СтатьяДвиженияДенежныхСредств = ЗаявкиНаРасходованиеСредствОстатки.СтатьяДвиженияДенежныхСредств
|ГДЕ	КорректировкаЗаявки.СуммаПлатежа-ЕстьNULL(ЗаявкиНаРасходованиеСредствОстатки.СуммаОстаток,0)>0	";

Запрос.УстановитьПараметр("ЗаявкаНаРасходование",ЗаявкаНаРасходованиеСредствИсточник);
Запрос.УстановитьПараметр("ТекущийДокумент",Ссылка);

Выборка=Запрос.Выполнить().Выбрать();
Если Выборка.Следующий() Тогда
	Сообщить("По договору "+Строка(Выборка.ДоговорКонтрагента)+", сделке "+Строка(Выборка.Сделка)+" и статье ДДС "+Строка(Выборка.СтатьяДвиженияДенежныхСредств)+" сумма больше, чем остаток");
	Отказ = Истина;
	Возврат;
Иначе
	Для Каждого СтрокаДанныеЗаявки Из ДанныеЗаявкиИсточник Цикл
		// регистр ЗаявкиНаРасходованиеСредств Расход
		Движение = Движения.ЗаявкиНаРасходованиеСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.ЗаявкаНаРасходование= ЗаявкаНаРасходованиеСредствИсточник;
		Движение.ДоговорКонтрагента = СтрокаДанныеЗаявки.ДоговорКонтрагента;
		Движение.Сделка = СтрокаДанныеЗаявки.Сделка;
		Движение.СтатьяДвиженияДенежныхСредств= СтрокаДанныеЗаявки.СтатьяДвиженияДенежныхСредств;
		Движение.Сумма= СтрокаДанныеЗаявки.СуммаПлатежа;
		Движение.СуммаВзаиморасчетов= СтрокаДанныеЗаявки.СуммаПлатежа;
		Движение.СуммаУпр= СтрокаДанныеЗаявки.СуммаПлатежа;
		
	КонецЦикла;
	
	Для Каждого СтрокаДанныеЗаявки Из ДанныеЗаявкиПриемник Цикл
		// регистр ЗаявкиНаРасходованиеСредств Расход
		Движение = Движения.ЗаявкиНаРасходованиеСредств.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ЗаявкаНаРасходование= ЗаявкаНаРасходованиеСредствПриемник;
		Движение.ДоговорКонтрагента = СтрокаДанныеЗаявки.ДоговорКонтрагента;
		Движение.Сделка = СтрокаДанныеЗаявки.Сделка;
		Движение.СтатьяДвиженияДенежныхСредств= СтрокаДанныеЗаявки.СтатьяДвиженияДенежныхСредств;
		Движение.Сумма= СтрокаДанныеЗаявки.СуммаПлатежа;
		Движение.СуммаВзаиморасчетов= СтрокаДанныеЗаявки.СуммаПлатежа;
		Движение.СуммаУпр= СтрокаДанныеЗаявки.СуммаПлатежа;
		
	КонецЦикла;

	// записываем движения регистров
	Движения.ЗаявкиНаРасходованиеСредств.Записать();
	
	
КонецЕсли;	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Если Ответственный<> глТекущийПользователь Тогда
	Ответственный =глТекущийПользователь;
	КонецЕсли;
КонецПроцедуры
